<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"812a0e8e05e37cb7847e6f3191509c032aa7f9cdc34a6de84eb18f887cb29e94","plan_job_ref":"Job Run Terraform plan in staging #56 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/11054878565","plan_out_hash":"aba76dacbc334eda4fa958688c50279446814b794c5ba695761c9c61a4c87595","plan_hash":"ee1631bcbf3e8229806743b4bdabcc2709b3f721bd2caef84aa6497386f4869e","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.egress_space.cloudfoundry_space.space will be created
+   resource "cloudfoundry_space" "space" {
+       allow_ssh                = (known after apply)
+       auditors                 = (known after apply)
+       delete_recursive_allowed = true
+       developers               = (known after apply)
+       id                       = (known after apply)
+       managers                 = (known after apply)
+       name                     = "rahearn-egress"
+       org                      = "f0a46189-6f64-43fb-99c3-0719cf9ee255"
    }

  # module.egress_space.cloudfoundry_space_users.space_permissions will be created
+   resource "cloudfoundry_space_users" "space_permissions" {
+       auditors   = (known after apply)
+       developers = [
+           "120c22e8-5b1a-494b-b5cb-3bee8ddd6690",
        ]
+       force      = false
+       id         = (known after apply)
+       managers   = [
+           "120c22e8-5b1a-494b-b5cb-3bee8ddd6690",
+           "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b",
        ]
+       space      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #56](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/11054878565)